app/serializers/race_serializer.rb

  def formatted_users
    user_array = []
    object.users.each do |user|
---
SELECT "users".* FROM "users" INNER JOIN "registrations" ON "users"."id" = "registrations"."user_id" WHERE "registrations"."race_id" = $1  [["race_id", 5]]