app/controllers/api/v1/races_controller.rb

SELECT "races".* FROM "races"
---
  def index
    render json: Race.all

SELECT  "races".* FROM "races" WHERE "races"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    render json: Race.find(params["id"])

SELECT  "races".* FROM "races" WHERE "races"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "registrations" ("user_id", "race_id") VALUES ($1, $2) RETURNING "id"  [["user_id", 2], ["race_id", 5]]
---
  def create
    binding.pry
    race = Race.find(params["id"])#would it be better to just use the params["id"]?
    user = current_user.id
    signUp = Registration.create!(race: race, user: current_user)