app/controllers/api/v1/registrations_controller.rb

  def index
    render json: Registration.all
---
SELECT "registrations".* FROM "registrations"

  def show
    render json: Race.find(params["id"]).users
---
SELECT  "races".* FROM "races" WHERE "races"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" INNER JOIN "registrations" ON "users"."id" = "registrations"."user_id" WHERE "registrations"."race_id" = $1  [["race_id", 2]]

  def create
    # Move user from old team to new team
    if !params["old_team"].nil?
      editRoster = Roster.find_by(team_id: params["old_team"]["id"], user: current_user)
      editRoster.team_id = params["joinTeam"]
      editRoster.save!
    else
      # User already registered to race, just add to team
      if Registration.find_by(race_id: params["race_id"], user: current_user)
        Roster.create!(user: current_user, team_id: params["joinTeam"])

      # Sign up user for race and maybe team
      else
        Registration.create!(race_id: params["race_id"], user: current_user)
        if !params["joinTeam"].nil?
          Roster.create!(user: current_user, team_id: params["joinTeam"])
        end
      end
    end
    render json: Race.find(params['race_id'])
---
INSERT INTO "rosters" ("user_id", "team_id") VALUES ($1, $2) RETURNING "id"  [["user_id", 4], ["team_id", 7]]
INSERT INTO "registrations" ("user_id", "race_id") VALUES ($1, $2) RETURNING "id"  [["user_id", 4], ["race_id", 2]]
SELECT  "races".* FROM "races" WHERE "races"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]