app/controllers/api/v1/teams_controller.rb

  def create
    Registration.create!(race_id: params["race_id"], user: current_user)
    newTeam = Team.create!(
      name: params["newTeamName"],
      motto: params["newTeamMotto"],
      race_id: params["race_id"]
    )

    Roster.create!(user: current_user, team: newTeam)
---
INSERT INTO "registrations" ("user_id", "race_id") VALUES ($1, $2) RETURNING "id"  [["user_id", 2], ["race_id", 1]]
INSERT INTO "teams" ("name", "motto", "race_id") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Name"], ["motto", "Motto"], ["race_id", 1]]
INSERT INTO "rosters" ("user_id", "team_id") VALUES ($1, $2) RETURNING "id"  [["user_id", 2], ["team_id", 11]]