app/controllers/homes_controller.rb

SELECT "users".* FROM "users"
SELECT "races".* FROM "races"
---
  def index
    @users = User.all
    @races = Race.all