app/controllers/races_controller.rb

INSERT INTO "races" ("distance", "name", "description", "price") VALUES ($1, $2, $3, $4) RETURNING "id"  [["distance", "29k"], ["name", "Evan Race"], ["description", "This is the worst race"], ["price", 97]]
---
  def create
    @race = Race.new(race_params)
    # @race.user = current_user

    if @race.save